tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/cask"           
tap "homebrew/cask-versions"  

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "bat"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "neovim"
brew "ripgrep"
brew "rustup-init"
brew "stow"
brew "tmux"
brew "zoxide"

cask "alacritty"
cask "arc"
cask "brave-browser"
cask "cryptomator"
cask "enpass"
cask "iina"
# cask "mountain-duck"
cask "obsidian"
cask "protonvpn"
cask "proton-drive"
cask "raycast"
cask "rectangle-pro"
cask "signal"
cask "yubico-yubikey-manager"           

cask "miniconda"
cask "font-jetbrains-mono-nerd-font"
