tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"
tap "supabase/tap"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "bash"
brew "bat"
brew "deno"
brew "elixir"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "go"
brew "jq"
brew "just"
brew "neovim"
brew "oven-sh/bun/bun"
brew "postgresql@15"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tailwindcss"
brew "tmux"
brew "wget"
brew "yazi"

cask "balenaetcher"
cask "brave-browser"
cask "enpass"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "keymapp"
cask "miniconda"
cask "obsidian"
cask "orcaslicer"
cask "proton-drive"
cask "proton-pass"
cask "raycast"
cask "rectangle-pro"
cask "termius"
cask "yubico-yubikey-manager"
cask "zen-browser"

mas "Proton Pass for Safari", id: 6502835663
mas "AdGuard for Safari", id: 1440147259
mas "Noir", id: 1592917505
mas "Pages", id: 409201541
