tap "homebrew/bundle"
# tap "homebrew/core"
# tap "homebrew/cask"           
# tap "homebrew/cask-versions"  

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

brew "bash"
brew "bat"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "git"
brew "go"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tailwindcss"
brew "tmux"
brew "tree-sitter"
brew "wget"
brew "zoxide"
brew "zsh"

cask "alacritty"
cask "arc"
cask "brave-browser"
cask "cryptomator"
cask "enpass"
cask "font-jetbrains-mono-nerd-font"
cask "freecad"
cask "miniconda"
cask "mixxx"
cask "obsidian"
cask "pearcleaner"
cask "proton-drive"
cask "proton-pass"
cask "protonvpn"
cask "raycast"
cask "rectangle-pro"
cask "yubico-yubikey-manager"           
